In [14]:
import pandas as pd

In [15]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [16]:
df2=pd.DataFrame({'C':[4,5,6],'D':[40,50,60]})
df2

   C   D
0  4  40
1  5  50
2  6  60

In [17]:
df1.join(df2) #join two df equal row and column

   A   B  C   D
0  1  10  4  40
1  2  20  5  50
2  3  30  6  60

In [18]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [20]:
df2=pd.DataFrame({'C':[4,5],'D':[40,50]})
df2

   C   D
0  4  40
1  5  50

In [22]:
df1.join(df2) #join two df equal row and column, no same value given nan

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [23]:
df1.join(df2, how="inner") #join two df in intersection, value not same row is skip

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [24]:
df1.join(df2, how="outer") #join to two df in union,  value not same row is show nan

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [27]:
df1.join(df2, how="left") #left df complete join, right table not same given nan

   A   B    C     D
0  1  10  4.0  40.0
1  2  20  5.0  50.0
2  3  30  NaN   NaN

In [29]:
df1.join(df2, how="right") #right df complete join, left table not same given nan

   A   B  C   D
0  1  10  4  40
1  2  20  5  50

In [30]:
df1=pd.DataFrame({'A':[1,2,3],'B':[10,20,30]})
df1

   A   B
0  1  10
1  2  20
2  3  30

In [32]:
df2=pd.DataFrame({'A':[5,6,7],'D':[40,50,60]})
df2

   A   D
0  5  40
1  6  50
2  7  60

In [35]:
df1.join(df2, lsuffix='_1') # two column name is same it not join we use lsuffix and rsuffix method

   A_1  D_1  A   D
0    5   40  5  40
1    6   50  6  50
2    7   60  7  60